In [256]:
import pandas as pd
df = pd.read_csv("stock_data.csv", skiprows = 1)

In [257]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [258]:
#give custom column names
df = pd.read_csv("stock_data.csv", skiprows = 2, names  = ["apple", "orange", "banana", "strawberry", "mango"])
df

   apple         orange  banana strawberry          mango
0  GOOGL          27.82      87        845     larry page
1    WMT           4.61     484         65           n.a.
2   MSFT             -1      85         64     bill gates
3   RIL   not available      50       1023  mukesh ambani
4   TATA            5.6      -1       n.a.     ratan tata

In [259]:
# where ever you find ['not available', 'n.a.', -1] replace it with NaN
df = pd.read_csv("stock_data.csv", skiprows = 1, na_values = ['not available', 'n.a.', -1])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT    NaN     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [260]:
# specifying specific columns to replace it with NaN
df = pd.read_csv("stock_data.csv", skiprows = 1, na_values = {
    'eps' : 'not available',
    'revenue' : [-1],
    'people' : ['not available', 'n.a.'],
    'price' : ['n.a.']
})
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [261]:
#creating a price to earning ratio column
df['price_to earning'] = df['price'] / df['eps']
df

  tickers    eps  revenue   price         people  price_to earning
0   GOOGL  27.82     87.0   845.0     larry page         30.373832
1     WMT   4.61    484.0    65.0            NaN         14.099783
2    MSFT  -1.00     85.0    64.0     bill gates        -64.000000
3    RIL     NaN     50.0  1023.0  mukesh ambani               NaN
4    TATA   5.60      NaN     NaN     ratan tata               NaN

In [262]:
#write to a new csv file and remove index from file, remove header (same as skiprows)
df.to_csv("price_to_earning_ratio.csv", index = False, header = False)

In [263]:
df_movies = pd.read_excel("movies_db.xlsx", "movies") #(file name, sheet name)

In [264]:
df

  tickers    eps  revenue   price         people  price_to earning
0   GOOGL  27.82     87.0   845.0     larry page         30.373832
1     WMT   4.61    484.0    65.0            NaN         14.099783
2    MSFT  -1.00     85.0    64.0     bill gates        -64.000000
3    RIL     NaN     50.0  1023.0  mukesh ambani               NaN
4    TATA   5.60      NaN     NaN     ratan tata               NaN

In [265]:
df_financials = pd.read_excel("movies_db.xlsx", "financials")
df_financials.head(6)

   movie_id  budget  revenue      unit currency
0       101     1.0     12.5  Billions      INR
1       102   200.0    954.8  Millions      USD
2       103   165.0    644.8  Millions       $$
3       104   180.0    854.0  Millions  Dollars
4       105   250.0    670.0  Millions      USD
5       107   400.0   2000.0  Millions      INR

In [266]:
#changing names of '$$','Dollars' to USD
#if we wanna change certain values in a specific columns
def convert_to_usd(curr):
    if curr == '$$' or curr == 'Dollars':
        return "USD"
    return curr
df_financials = pd.read_excel("movies_db.xlsx", "financials", converters = {
    'currency' : convert_to_usd
})
df_financials.head(5)

   movie_id  budget  revenue      unit currency
0       101     1.0     12.5  Billions      INR
1       102   200.0    954.8  Millions      USD
2       103   165.0    644.8  Millions      USD
3       104   180.0    854.0  Millions      USD
4       105   250.0    670.0  Millions      USD

In [267]:
#merging two data frames (2 tables) using movie_id column
df_merged = pd.merge(df_movies, df_financials, on="movie_id")
df_merged.head(3)

,movie_id,title,industry,release_year,imdb_rating,studio,language_id,budget,revenue,unit,currency
0,101,K.G.F: Chapter 2,Bollywood,2022,8.4,Hombale Films,3,1.0,12.5,Billions,INR
1,102,Doctor Strange in the Multiverse of Madness,Hollywood,2022,7.0,Marvel Studios,5,200.0,954.8,Millions,USD
2,103,Thor: The Dark World,Hollywood,2013,6.8,Marvel Studios,5,165.0,644.8,Millions,USD

In [268]:
df_merged = df_merged.to_excel("movies_merged.xlsx", sheet_name="Sheet1", index=False)

In [282]:
#creating data frames from vs-code and writing to multiple excel at one time

df1 = pd.DataFrame({
    'CarName' : ['bugatti', 'rolls ryce', 'pagani'],
    'TopSpeed' : ['430mph', '350mph', '280mph'],
    'Colour' : ['Red', 'White', 'Black']
})

In [285]:
df2 = pd.DataFrame({
    'FoodName' : ['bugatti', 'rolls ryce', 'pagani'],
    'Healthy' : [False, True, True],
    'Taste' : ['Awesome', 'ok', 'Terrible']
})

In [286]:
#writing multiple data frames into excel files
with pd.ExcelWriter('cars_and_food.xlsx') as writer:
    df1.to_excel(writer, sheet_name = "cars", index=False)
    df2.to_excel(writer, sheet_name = "foods", index = False)